.global _start //Говорим линковщику о существовании _start

.text //Указываем что дальше идёт текст  с кодом
_start:
    //; 1. Печатаем цифру 2 на экран
    mov $1, %rax        ; //Системный вызов №1 в Linux (sys_write)
    mov $1, %rdi        ; //Куда выводить: 1 = дескриптор консоли (stdout)
    mov $msg, %rsi      ; //Адрес нашей строки в памяти
    mov $2, %rdx        ; //Сколько байт напечатать (1 символ)
    syscall             ; //Передаем управление Linux, он печатает

    //; 2. Правильно завершаем программу (иначе будет Segmentation fault)
    mov $60, %rax       ; //Системный вызов №60 (sys_exit)
    xor %rdi, %rdi      ; //Код возврата 0 (успешно)
    syscall             ; //Передаем управление Linux, программа закрывается

.section .rodata
msg: 
    .ascii "2\n"          ; //Сама наша двойка в памяти
